ka2_2024/src/Documents/ВходящийДокументСЭДОФСС/ВходящийДокументСЭДОФСС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВходящийДокументСЭДОФСС</name>
  <comment>Входящий документ ФК &quot;Доходная часть&quot; СЭДО</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийФайл</name>
    <type>
      <types>CatalogRef.ВходящийДокументСЭДОФССПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокументаФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИмпорта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Загружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПодтверждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиПодтверждения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиОтветаНаЗапрос</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждениеПолученоФСС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДатаПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДатаОтправкиОтвета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийФайлПодписьСотрудникаФонда</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийФайлПодписьФонда</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КалендарьБылНезаполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерСФР</name>
    <comment>Значение реквизита regNumSFR</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерФСС</name>
    <comment>Значение реквизита regNumSFR</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапрашиваемыеДокументы</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДокументов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОшибкиЛогическогоКонтроля</name>
    <attributes>
      <name>ОтветНаТребованиеФСС</name>
      <type>
        <types>DocumentRef.ОтветСтрахователяНаТребованиеПроверкиФСС</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСообщенияОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяПриемаОтказа</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СодержимоеОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УведомленияОПриемеОтказе</name>
    <attributes>
      <name>ОтветНаТребованиеФСС</name>
      <type>
        <types>DocumentRef.ОтветСтрахователяНаТребованиеПроверкиФСС</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСообщенияПротокола</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПолученияПротокола</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НаборДокументов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДокументовВоВложении</name>
      <comment>Максимальное значение 50000</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФайлыПриложений</name>
    <attributes>
      <name>ВидФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФайлПриложения</name>
      <type>
        <types>CatalogRef.ВходящийДокументСЭДОФССПрисоединенныеФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>ФайлПриложенияПодписьСотрудникаФонда</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ФайлПриложенияПодписьФонда</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/Documents/ВходящийДокументСЭДОФСС/Forms/ФормаФайлыПриложений/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ПрефиксИмениФайлаПечатнойФормы = ЭлектронныйДокументооборотСФССКлиентСервер.ПрефиксИмениФайлаПечатнойФормыДокументаДоходнойЧастиСЭДО();
	Если Параметры.Свойство("Основание") Тогда
		ДокументСсылка = Параметры.Основание;
		Если ЗначениеЗаполнено(ДокументСсылка) Тогда
			Для каждого Файл из ДокументСсылка.ФайлыПриложений Цикл
				Если НЕ СтрНачинаетсяС(Файл.ИмяФайла, ПрефиксИмениФайлаПечатнойФормы)
					И НЕ Файл.ВидФайла = ДокументСсылка.ВидДокументаФСС Тогда
					РеквизитыФайла = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Файл.ФайлПриложения, "Размер, Расширение");
					НовыйФайл						= Файлы.Добавить();
					НовыйФайл.ИмяФайлаПриложения	= Файл.ИмяФайла + "." + РеквизитыФайла.Расширение;
					ПредставлениеРазмера = ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ТекстовоеПредставлениеРазмераФайла(
						РеквизитыФайла.Размер);
					НовыйФайл.РазмерФайлаПриложения	= ПредставлениеРазмера;
					НовыйФайл.ФайлПриложенияСсылка	= Файл.ФайлПриложения;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ФайлыИмяФайлаПриложения" Тогда
		ТекущиеДанные = Элементы.Файлы.ТекущиеДанные;
		
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ТекущиеДанные.ФайлПриложенияСсылка.Пустая() Тогда
			
			ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(ТекущиеДанные.ФайлПриложенияСсылка,
				ЭтотОбъект.УникальныйИдентификатор, Истина);
				
			РасширениеPDF = "pdf";
			Если ВРег(ДанныеФайла.Расширение) = ВРег(РасширениеPDF)
				И НЕ ЭлектронныйДокументооборотСФССКлиент.ЭтоФайлPDF(ДанныеФайла) Тогда
				ТекстСообщения = НСтр("ru = 'Открыть файл с вложением невозможно. С сервера СФР получен некорректный файл pdf.'");
				ПоказатьПредупреждение(, ТекстСообщения);
				Возврат;
			КонецЕсли;
			
			РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, Ложь);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
